---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.FontName
source: html/8ab69fb8-6ff8-8dd9-7909-509f5a9dace7.htm
---
# Autodesk.Revit.DB.TableCellStyle.FontName Property

The font used for this style

## Syntax (C#)
```csharp
public string FontName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null